In [1]:
import pandas as pd

In [2]:
def count_top3(years):
    y_list = []
    for year in years:
        y_list.append(pd.read_csv(f'names/yob{year}.txt', names=['name', 'gender', 'quantity']))
        years = pd.concat(y_list)
        res = years.groupby(['name', 'gender']).sum()[['quantity']]
        res.sort_values('quantity', inplace=True, ascending=False)
        res = res[:3]
    return res

In [3]:
def count_dynamics(years):
    y_list = pd.DataFrame()
    for year in years:
        df = pd.read_csv(f'names\yob{year}.txt', names = ['name', 'gender', 'quantity'])
        df['year'] = year
        y_list = pd.concat([y_list, df])
        res = y_list.groupby(['year','gender']).sum()
    return res

In [4]:
count_top3([1880])

                quantity
name    gender
John    M           9655
William M           9532
Mary    F           7065

In [5]:
count_top3([1900, 1950, 2000])

               quantity
name   gender
James  M         111456
John   M         109349
Robert M         101118

In [6]:
count_dynamics([1900, 1950, 2000])

             quantity
year gender
1900 F         299798
     M         150480
1950 F        1713065
     M        1790437
2000 F        1815295
     M        1963202